Revit 2027 API
XYZ Constructor
Creates a default XYZ with the values (0, 0, 0).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ()
Public Sub New
public:
XYZ()
new : unit -> XYZ
See Also
Reference
XYZ Class
XYZ Overload
Autodesk.Revit.DB Namespace